
/*
10
"유재석"
true
{}
[]
function
undefined
null
*/

// 콘솔(결과물이 표현되는 구역) 에 출력
// 콘솔에 10 출력
console.log(10) // JS 문법

// 변수란? 하나의 자료 저장하는 메모리(컴퓨터 저장 단위) 공간
// 같은 파일내에 변수명은 중복 X
let 이름상자1 // "이름상자" 변수 상자 선언 초기화 X
let 이름상자2 = 10 // 서로 다른 변수명으로 변수 선언, 10으로 초기화

// 변수의 값 호출
이름상자2               // 변수명 작성하여 변수값 호출
console.log(이름상자2)  // 변수명 작성해서 변수값 호출, console에 출력

// 변수의 값 수정
이름상자2 = 100
console.log(이름상자2)

// 상수란? 하나의 자료를 저장하는 메모리 공간, 수정 X
const 이름상자3 = 300
이름상자3

// 생각해보기
let point1 = 50
let point2 = 50
let point3 = 100
let point4 = point1 + point2

// 변수는 4개 리터럴은 2개
// 변수의 특징 : 저장, 동일한 자료를 서로 다른 곳에 저장

